documents/images/graphio/stdlib/contrast_vector4FA.dot
digraph {
  rankdir = LR;
    NG_contrast_vector4FA_N_add_vector4FA [label= "add"];
    NG_contrast_vector4FA_N_add_vector4FA[shape = box];
    NG_contrast_vector4FA_N_add_vector4FA ->     NG_contrast_vector4FA_out;
    NG_contrast_vector4FA_out [label= "out"];
    NG_contrast_vector4FA_out[shape = box]; 
    NG_contrast_vector4FA_pivotINT [label="pivot"];
    NG_contrast_vector4FA_pivotINT [shape = ellipse];
    NG_contrast_vector4FA_N_add_vector4FA [label="add"];
    NG_contrast_vector4FA_pivotINT -> NG_contrast_vector4FA_N_add_vector4FA [label=".in2"];
    NG_contrast_vector4FA_N_mul_vector4FA [label= "multiply"];
    NG_contrast_vector4FA_N_mul_vector4FA[shape = box];
    NG_contrast_vector4FA_N_mul_vector4FA ->     NG_contrast_vector4FA_N_add_vector4FA [label= "in1"];
    NG_contrast_vector4FA_N_add_vector4FA [label= "add"];
    NG_contrast_vector4FA_N_add_vector4FA[shape = box]; 
    NG_contrast_vector4FA_amountINT [label="amount"];
    NG_contrast_vector4FA_amountINT [shape = ellipse];
    NG_contrast_vector4FA_N_mul_vector4FA [label="multiply"];
    NG_contrast_vector4FA_amountINT -> NG_contrast_vector4FA_N_mul_vector4FA [label=".in2"];
    NG_contrast_vector4FA_N_sub_vector4FA [label= "subtract"];
    NG_contrast_vector4FA_N_sub_vector4FA[shape = box];
    NG_contrast_vector4FA_N_sub_vector4FA ->     NG_contrast_vector4FA_N_mul_vector4FA [label= "in1"];
    NG_contrast_vector4FA_N_mul_vector4FA [label= "multiply"];
    NG_contrast_vector4FA_N_mul_vector4FA[shape = box]; 
    NG_contrast_vector4FA_inINT [label="in"];
    NG_contrast_vector4FA_inINT [shape = ellipse];
    NG_contrast_vector4FA_N_sub_vector4FA [label="subtract"];
    NG_contrast_vector4FA_inINT -> NG_contrast_vector4FA_N_sub_vector4FA [label=".in1"];
    NG_contrast_vector4FA_pivotINT [label="pivot"];
    NG_contrast_vector4FA_pivotINT [shape = ellipse];
    NG_contrast_vector4FA_N_sub_vector4FA [label="subtract"];
    NG_contrast_vector4FA_pivotINT -> NG_contrast_vector4FA_N_sub_vector4FA [label=".in2"];
}
